from aiogram import Router
from aiogram.filters import Command
from aiogram.types import Message

from database import get_cg_key
from keyboards import auth_kb, main_kb

router = Router()

success_text = (
    "Вход успешен!\n\n"
    "Теперь вы можете пользоваться функционалом бота.\n"
    "Доступные команды:\n\n"
    "💰 Цены и конвертация\n"
    "/price <монета> <валюта> — цена монеты\n"
    "/convert <из> <в> <количество> — конвертация валют\n\n"
    "🏆 Информация о рынке\n"
    "/coin <id> — подробная информация о монете\n"
    "/search <название> — поиск монеты\n"
    "⏰ Алерты\n"
    "/alert <монета> <выше/ниже> <значение> [валюта] — создать алерт\n"
    "/alert_remove <id> — удалить алерт\n\n"
    "Теперь можно начинать!"
)

@router.message(Command('start'))
async def cmd_start(message: Message):
    await message.answer(f"Привет {message.from_user.full_name}\n"
                         "Я бот трекер криптовалют и имею следующий функционал\n"
                         "Чтобы начать регистрацию пожалуйста нажмите кнопку ниже",
                         reply_markup=auth_kb)
    
@router.message(Command("help"))
async def cmd_help(message: Message):
    text = (
        "🆘 Помощь по командам\n\n"
        "Вот что я умею:\n\n"
        "💰 Цены и конвертация\n"
        "/price <монета> <валюта> — узнать цену монеты\n"
        "/convert <из> <в> <количество> — конвертация крипты\n\n"
        "🏆 Информация о рынке\n"
        "/coin <id> — подробная информация о монете\n"
        "/coins — список доступных монет\n"
        "/search <название> — поиск монеты\n"
        "⭐ Топ 10 — топ монет по капитализации\n"
        "🔥 Тренды — что сейчас в топе по активности\n\n"
        "🔔 Алерты\n"
        "/alert <coin> <выше/ниже> <цена> [валюта] — создать алерт\n"
        "/alert_remove <id> — удалить алерт\n"
        "🔔 Мои алерты — список активных алертов\n\n"
        "🧑‍💻 Аккаунт\n"
        "Вход/регистрация — сохранить API Key"
    )
    await message.answer(text, reply_markup=main_kb)


@router.message(Command("about"))
async def cmd_about(message: Message):
    text = (
        "ℹ️ О боте\n\n"
        "Этот бот является крипто-трекером, который получает данные с CoinGecko API.\n\n"
        "📊 Возможности:\n"
        "• цены криптовалют\n"
        "• топ-10 монет\n"
        "• тренды\n"
        "• подробная информация по монетам\n"
        "• конвертация крипто → крипто\n"
        "• уведомления (алерты) по цене\n\n"
        "🧩 Разработчик: TimaDinoSuperPuper\n"
        "⚙️ Библиотека: Aiogram 3\n"
        "🌐 Источник данных: CoinGecko API\n\n"
        "Спасибо, что используете бота!"
    )
    await message.answer(text, reply_markup=main_kb)